cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "caskroom/fonts"
tap "kryptco/tap"

brew "kryptco/tap/kr"
brew "aria2"
brew "mosh"
brew "gitup"
brew "trash"
brew "git"
brew "gpg"
brew "gpg-agent"
brew "pinentry"
brew "pinentry-mac"
brew "jq"
brew "rmate"
brew "ctags"

brew "mas"
# mas list
# find: (\d+)\s([^(]+)\s[(](.*)[)]
# replace: mas "$2", id: $1
mas "Paprika Recipe Manager 3", id: 1303222628
mas "SkySafari 6 Pro", id: 1362059613
mas "Things3", id: 904280696
mas "BetterSnapTool", id: 417375580
mas "Textual", id: 896450579
mas "Evernote", id: 406056744
mas "Rested", id: 421879749
mas "ScreenSharingMenulet", id: 578078659
mas "The Unarchiver", id: 425424353
mas "1Password 7", id: 1333542190
mas "Serial", id: 877615577
mas "Affinity Photo", id: 824183456
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Bear", id: 1091189122
mas "Microsoft Remote Desktop", id: 715768417
mas "Slack", id: 803453959
mas "PopClip", id: 445189367
mas "SSH Tunnel", id: 734418810
mas "Kaleidoscope", id: 587512244
mas "Core Tunnel – SSH Tunnel 2", id:1354318707

cask "hyper"
cask "keybase"
cask "vagrant"
cask "iterm2"
cask "docker"
cask "google-chrome"
cask "visual-studio-code"
cask "dash"
cask "github"
cask "citrix-receiver"
cask "viscosity"
cask "airserver"
cask "little-snitch"
cask "royal-tsx"
cask "steam"
cask "keepingyouawake"
cask "powershell"
cask "backblaze"
cask "appcleaner"
cask "ksdiff"
cask "virtualbox"
cask "gpg-suite"
cask "font-fira-code"
cask "transmit"
cask "1password-cli"
cask "discord"
cask "keepingyouawake"